Manacher算法（马拉车）

回文串的信息要怎样存？
	如果存回文子串的开头和结尾位置
	最差情况需要O(n^2)的空间
	
	回文串之间有包含关系
	一系列具有包含关系的回文串，只保存最长的
	
	回文串的圆心：它最中间的位置
		（可能是字符，也可能是两个字符的间隔）
	回文串的半径：长度/2
	
	只需要存储圆心和半径
	
第一步：把S交错插入'#'，求新字符串的圆心和半径

S = abcba
S' = #a#b#c#b#a#

第二步：回文串长度扩展
	int d[maxn];   
	d[i]表示S'中，以S'[i]为圆心的回文串的最大半径
	S'[i - d[i] ... i + d[i]]是回文串

d初始化为0
int o = 0, R = 0
for(int i = 0; i <= 2 * n; i++)
{
	if(i <= R)
	{
		int j = 2 * o - i;
		d[i] = min(d[j], R - i);
	}
	while(i - d[i] - 1 >= 0 &&
		i + d[i] + 1 <= 2 * n &&
		s[i - d[i] - 1] == s[i + d[i] + 1]) 
		d[i]++;
	if(i + d[i] > R)
	{
		o = i;
		R = i + d[i];
	} 
}

S = abcbabcba

S' = #a#b#c#b#a#

S = abcba
d[] = {0, 1, 0, 1, 0, 5, 0, 1, 0, 1, 0}

S = abaaba
S' = #a#b#a#a#b#a#
d[] = {0, 1, 0, 3, 0, 1, 6, 1, 0, 3, 0, 1, 0} 


abcdba

abdcba 
